---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpotDimension
source: html/7b7df2bf-07d5-2823-d8d6-503144c1c463.htm
---
# SpotDimension Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.